app/views/songs/index.html.erb


<% @playlist.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" INNER JOIN "tracklists" ON "songs"."id" = "tracklists"."song_id" WHERE "tracklists"."playlist_id" = $1  [["playlist_id", 4]]