app/controllers/playlists_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 4]]
---
  def show
    @playlist = Playlist.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @user = User.find(session[:user_id])

INSERT INTO "playlists" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "This"], ["created_at", "2016-01-24 21:26:52.226331"], ["updated_at", "2016-01-24 21:26:52.226331"]]
---
  def create
    if session[:spotify_user]
      @user = RSpotify::User.new(session[:spotify_user])
      @user.create_playlist!(playlist_params[:title])

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "playlists" WHERE "playlists"."id" = $1  [["id", 3]]
---
  def destroy
    @playlist = Playlist.find(params[:id])
    @playlist.destroy