app/controllers/songs_controller.rb

SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT 1  [["id", nil]]
---
  def index
    @playlist = Playlist.find(params[:playlist_id])