app/views/playlists/new.html.erb


<% @user.playlists.each do |playlist| %>
---
SELECT "playlists".* FROM "playlists" WHERE "playlists"."user_id" = $1  [["user_id", 1]]