app/views/playlists/show.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "tracklists" ON "songs"."id" = "tracklists"."song_id" WHERE "tracklists"."playlist_id" = $1  [["playlist_id", 4]]
---
<% @playlist.songs.each do |song| %>